Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Certain commonly used Java methods are overridden by user classes, e.g. `toString`, `equals`, `hashCode`...etc. The majority of overrides do not cause problems, but if they use third party libraries (e.g. for additional formatting), or use dynamic language features (e.g. reflection or proxies), they can cause native image build to fail. Some of those failures might be solvable via configuration, but others can be more tricky to handle.
ja_jp: 特定の一般的に使用される Java メソッドは、`toString`、`equals`、`hashCode` などのユーザークラスによってオーバーライドされます。オーバーライドの大部分は問題を引き起こしませんが、サードパーティーのライブラリー (追加の書式設定など) や動的言語機能 (リフレクションやプロキシーなど) を使用したりすると、ネイティブイメージのビルドが失敗する可能性があります。これらの障害の中には、設定によって解決できるものもありますが、処理がより難しいものもあります。

source: Certain commonly used Java methods are overriden by user classes, e.g. `toString`, `equals`, `hashCode`...etc. The majority of overrides do not cause problems, but if they use third party libraries (e.g. for additional formatting), or use dynamic language features (e.g. reflection or proxies), they can cause native image build to fail. Some of those failures might be solvable via configuration, but others can be more tricky to handle.
ja_jp: 特定の一般的に使用される Java メソッドは、 `toString`、 `equals`、 `hashCode` などのユーザークラスによってオーバーライドされます。オーバーライドの大部分は問題を引き起こしませんが、サードパーティーのライブラリー (追加の書式設定など) を使用したり、動的言語機能 (リフレクションやプロキシーなど) を使用したりすると、ネイティブイメージのビルドが失敗する可能性があります。これらの障害の中には、設定によって解決できるものもありますが、処理がより難しいものもあります。

source: Certain registry options could be initialized with their specific environment variables. Each such option will have the following environment variable prefix:
ja_jp: 特定のレジストリーオプションは、それぞれの環境変数で初期化できます。そのような各オプションには、次の環境変数プレフィックスが付与されます。

source: Certain types of build items are generally always consumed, such as generated classes or resources. An extension might produce a build item along with a generated class to facilitate the usage of that build item. Such a build step would use the `@Weak` annotation on the generated class build item, while normally producing the other build item. If the other build item is ultimately consumed by something, then the step would run and the class would be generated. If nothing consumes the other build item, the step would not be included in the build process.
ja_jp: 生成されたクラスやリソースなど、特定の種類のビルドアイテムは通常は常に消費されます。エクステンションは、生成されたクラスとともにビルドアイテムを生成して、そのビルドアイテムの使用を容易にする場合があります。このようなビルドステップでは、生成されたクラスビルドアイテムに `@Weak` アノテーションを使用しますが、通常は他のビルドアイテムを生成します。他のビルドアイテムが最終的に何かによって消費された場合、ステップが実行され、クラスが生成されます。他のビルドアイテムを消費するものがない場合、そのステップはビルドプロセスに含まれません。

source: Certainly, here's a step-by-step guide on how to use complex configuration structures with Quarkus:
ja_jp: Quarkusで複雑な設定構造を使用する方法について、ステップバイステップで説明します：

source: Certificate Revocation List (CRL)
ja_jp: 証明書失効リスト (CRL)

source: Certificate Revocation Lists (CRLs) are valid.
ja_jp: 証明書失効リスト (CRL) が有効である。

source: Certificate chain validation
ja_jp: 証明書チェーンの検証

source: Certificate renewal
ja_jp: 証明書の更新

source: Certificates are valid.
ja_jp: 証明書が有効である。

source: Chain-of-Thought (CoT) Reasoning
ja_jp: 思考連鎖 (CoT) 推論

source: Chain-of-Thought (CoT) guides LLMs through explicit intermediate steps to solve complex problems. This systematic approach breaks tasks into manageable sub-problems for sequential processing and solution building. CoT enhances LLM accuracy, enabling understanding and debugging, especially for multi-step reasoning in mathematical problem-solving, code generation, and logical inference.
ja_jp: 思考連鎖 (CoT) は、明示的な中間ステップを通じてLLMを導き、複雑な問題を解決します。この系統的なアプローチは、タスクを管理可能なサブ問題に分解し、シーケンシャル処理とソリューション構築を行います。CoTはLLMの精度を向上させ、特に数学的問題解決、コード生成、論理的推論における多段階推論において、理解とデバッグを可能にします。

source: Chaining Kafka Transactions with Hibernate ORM transactions
ja_jp: KafkaトランザクションとHibernate ORMトランザクションのチェーン

source: Chaining Kafka Transactions with Hibernate Reactive transactions
ja_jp: Kafka トランザクションと Hibernate Reactive トランザクションとのチェーン

source: Change GraphQL endpoints to be Singleton by default
ja_jp: GraphQLのエンドポイントをデフォルトでSingletonに変更

source: Change Quarkus HTTP Port
ja_jp: Quarkus HTTPポートの変更

source: Change build time properties after your application has been published
ja_jp: アプリケーションが公開された後、ビルド時のプロパティー変更

source: Change configuration after build (Reaugmentation)
ja_jp: ビルド後の設定変更 (再オーグメンテーション)

source: Change dependencies
ja_jp: 依存関係を変更する

source: Change is Inevitable
ja_jp: 変化は必然です

source: Change it back and the tests will run again.
ja_jp: これを元に戻すと、テストが再び実行されます。

source: Change the Http Root path
ja_jp: Http ルートパスの変更

source: Change the `sayHello` method return type by using a reactive or asynchronous data type.
ja_jp: リアクティブまたは非同期データ型を使用して、`sayHello` メソッドの戻り値の型を変更します。

source: Change the default thread model for RESTEasy Reactive
ja_jp: RESTEasy Reactiveのデフォルトのスレッドモデルの変更

source: Change the last two commands in the `Dockerfile.native` file and make it read like this:
ja_jp: `Dockerfile.native` ファイルの最後の 2 つのコマンドを変更して、以下のように読み込み可能にします。

source: Change the method to the following:
ja_jp: メソッドを以下のように変更します。

source: Change this setting only in advanced use cases and only if you are certain recovery is not required. Incorrect configuration can lead to data loss, data unavailability, or both, due to resources remaining locked indefinitely.
ja_jp: この設定は、高度なユースケースであり、リカバリーが不要であることが確実な場合にのみ変更してください。 誤った設定は、リソースが無期限にロックされたままになるため、データ損失やデータの利用不能、あるいはその両方を引き起こす可能性があります。

source: Change to the application directory: `cd getting-started-with-heroku`.
ja_jp: アプリケーションディレクトリーに移動します: `cd getting-started-with-heroku`

source: Changelog: https://github.com/redhat-developer/vscode-quarkus/blob/master/CHANGELOG.md
ja_jp: 変更履歴: https://github.com/redhat-developer/vscode-quarkus/blob/master/CHANGELOG.md

source: Changing configuration values
ja_jp: 設定値の変更

source: Changing the OpenAPI version
ja_jp: OpenAPIのバージョン変更

source: Changing the OpenAPI version between `3.0.x` and `3.1.x` versions will result in changes to the rendered document to satisfy the requirements of the chosen version. A good starting point to learn about the differences between OpenAPI 3.0 and 3.1 is the https://www.openapis.org/blog/2021/02/16/migrating-from-openapi-3-0-to-3-1-0[OpenAPI Initiative].
ja_jp: OpenAPI バージョンを `3.0.x` と `3.1.x` の間で変更すると、選択したバージョンの要件を満たすようにレンダリングされたドキュメントが変更されます。OpenAPI 3.0 と 3.1 の違いを知るには、まず https://www.openapis.org/blog/2021/02/16/migrating-from-openapi-3-0-to-3-1-0[OpenAPI Initiative] を参照することを推奨します。

source: Changing the configuration file is immediately reflected.
ja_jp: 設定ファイルの変更はすぐに反映されます。

source: Changing the configuration file is immediately reflected. You can add the `greeting.suffix`, remove the other properties, change the values, etc.
ja_jp: 設定ファイルの変更はすぐに反映されます。 `greeting.suffix` の追加、他のプロパティーの削除、値の変更などが可能です。

source: Changing the console log format is useful, for example, when the console output of the Quarkus application is captured by a service that processes and stores the log information for later analysis.
ja_jp: コンソールログの形式の変更は便利です。例えば、Quarkusアプリケーションのコンソール出力が、後で分析するためにログ情報を処理して保存するサービスによってキャプチャされる場合などです。

source: Changing the expiration policy or the maximum size of a `CaffeineCache` in real time
ja_jp: リアルタイムで `CaffeineCache` の有効期限ポリシーや最大サイズを変更

source: Changing the generated deployment resource
ja_jp: 生成されるデプロイメントリソースの変更

source: Changing the number of replicas
ja_jp: レプリカ数を変更する

source: Changing the number of replicas:
ja_jp: レプリカ数を変更する

source: Changing the perspective
ja_jp: 視点の転換

source: Changing the test port
ja_jp: テストポートの変更

source: Changing your development model is not simple. It requires relearning and restructuring code in a non-blocking fashion. Fortunately, you don't have to do it!
ja_jp: 開発モデルの変更は簡単ではありません。再学習および、ノンブロッキングでコードを再構築する必要があります。幸いなことに、その必要はありません。

source: Channel Decorators
ja_jp: チャンネルデコレーター

source: Channel attributes can be configured using the `mp.messaging.incoming.<channel-name>` and `mp.messaging.outgoing.<channel-name>` configuration properties.
ja_jp: チャネル属性は、`mp.messaging.incoming.<channel-name>` および `mp.messaging.outgoing.<channel-name>` 設定プロパティーを使用して設定できます。

source: Channel configuration
ja_jp: チャネル設定

source: Channel configuration properties named with `[Client|Producer|Consuemr]ConfigurationData` field names.
ja_jp: `[Client|Producer|Consuemr]ConfigurationData` フィールド名を使用して名前が付けられたチャネル設定プロパティー

source: Channel health checks can be disabled using `quarkus.messaging.health.<channel-name>.enabled` or per health check type, ex. `quarkus.messaging.health.<channel-name>.liveness.enabled`.
ja_jp: チャネルのヘルスチェックは、`quarkus.messaging.health.<channel-name>.enabled` を使用して無効化できます。またはヘルスチェックタイプごとに無効化できます。 (例: `quarkus.messaging.health.<channel-name>.liveness.enabled`)

source: Channel metrics
ja_jp: チャネルメトリクス

source: Channel wiring and Messaging patterns
ja_jp: チャネルワイヤリングとメッセージングパターン

source: Channels are connected to message backends using *connectors*. Connectors are configured to map incoming messages to a specific channel (consumed by the application) and collect outgoing messages sent to a specific channel. Each connector is dedicated to a specific messaging technology. For example, the connector dealing with Pulsar is named `smallrye-pulsar`.
ja_jp: チャネルは *コネクター* を使用してメッセージバックエンドに接続します。 コネクターは、着信メッセージを特定のチャネル (アプリケーションが消費するチャネル) にマッピングし、特定のチャネルに送信された発信メッセージを収集するように設定されています。 各コネクターは、特定のメッセージングテクノロジーに特化しています。 たとえば、Pulsar を処理するコネクターの名前は、 `smallrye-pulsar` となっています。

source: Channels are connected to message backends using *connectors*. Connectors are configured to map incoming messages to a specific channel (consumed by the application) and collect outgoing messages sent to a specific channel. Each connector is dedicated to a specific messaging technology. For example, the connector dealing with Kafka is named `smallrye-kafka`.
ja_jp: チャネルは、 *コネクター* を使用してメッセージバックエンドに接続されます。コネクターは、着信メッセージを特定のチャネル (アプリケーションによって消費される) にマッピングし、特定のチャネルに送信された発信メッセージを収集するように設定されています。各コネクターは、特定のメッセージングテクノロジーに特化しています。たとえば、Kafka を処理するコネクターの名前は `smallrye-kafka` となっています。

source: Character Escapes
ja_jp: 文字エスケープ

source: Chat using <a href="https://quarkusio.zulipchat.com" target="_blank">Zulip</a> (<code>#dev</code> stream)
ja_jp: <a href="https://quarkusio.zulipchat.com" target="_blank">Zulip</a>によるチャット (<code>#dev</code> stream)

source: Cheap to block
ja_jp: 安価なブロック

source: Cheap to create
ja_jp: 作成が安価

source: Cheat Sheets
ja_jp: チートシート

source: Check <<jackson-serialization>> for more detail about the usage of Jackson with Kafka. You can also use Avro.
ja_jp: Kafka での Jackson の使用に関する詳細は、<<jackson-serialization>> を確認してください。 Avro を使用することもできます。

source: Check HTTP headers, for example, with a URL path always being '/service', a header such as "Realm: service" or "Realm: management" can help selecting between the `tenant-service` and `tenant-manage` configurations
ja_jp: たとえば、URL パスが常に '/service' である HTTP ヘッダーを確認します。"Realm: service" や "Realm: management" などのヘッダーは、 `tenant-service` 設定や `tenant-manage` 設定のいずれかを選択する場合に役立ちます。

source: Check HTTP headers, for example, with a URL path always being '/service', a header such as "Realm: service" or "Realm: management" can help to select between the `tenant-service` and `tenant-manage` configurations
ja_jp: たとえば、URL パスが常に '/service' である HTTP ヘッダーを確認します。"Realm: service" や "Realm: management" などのヘッダーは、 `tenant-service` 設定や `tenant-manage` 設定のいずれかを選択する場合に役立ちます。

source: Check URL paths, for example, a `tenant-service` configuration has to be used for the "/service" paths, while a `tenant-manage` configuration - for the "/management" paths
ja_jp: URL パスを確認します。たとえば、"/service" パスには `tenant-service` 設定を使用する必要がありますが、 "/management" パスには `tenant-manage` 設定を使用する必要があります。

source: Check URL query parameters - it can work similarly to the way the headers are used to select the tenant configuration
ja_jp: URL クエリーパラメーターを確認します。ヘッダーを使用してテナント設定を選択するのと同じように機能します

source: Check all JWKS if no ley matching the token key id ('kid') is found
ja_jp: トークンのキー ID ('kid') に一致する鍵が見つからない場合に、すべての JWKS をチェックします

source: Check code for anti-patterns
ja_jp: アンチパターンのコードチェック。

source: Check errors in the logs
ja_jp: ログでのエラーの確認

source: Check every minute if the current access token is expired and must be refreshed.
ja_jp: 現在のアクセストークンが期限切れで更新が必要な場合、毎分チェックします。

source: Check every minute whether the current access token is expired and must be refreshed.
ja_jp: 現在のアクセストークンが期限切れで更新が必要かどうかを毎分確認します。

source: Check http://localhost:8080/hello/names. It should be working again, because the Dev Services have been re-enabled. Notice that there was no need to restart Quarkus for any of these changes.
ja_jp: http://localhost:8080/hello/names を確認します。Dev Services が再度有効化されたので、 再び動作しているはずです。 これらの変更のいずれにおいても、Quarkus を再起動する必要がなかったことに注意してください。

source: Check https://quarkus.io/guides/performance-measure[Quarkus - Measuring Performance] to learn more about RSS and how to measure it
ja_jp: RSSとその測定方法については、 link:https://quarkus.io/guides/performance-measure[Quarkus - パフォーマンスの計測]をご覧ください。

source: Check if a bean is active before retrieving it.
ja_jp: ビーンを取得する前に、ビーンがアクティブかどうかをチェックします。

source: Check if the extension is listed in the http://https://registry.quarkus.io/q/swagger-ui/#/Client/get_client_extensions_all[Quarkus registry] list of all known extensions
ja_jp: エクステンションが、 http://https://registry.quarkus.io/q/swagger-ui/#/Client/get_client_extensions_all[Quarkus レジストリー] のすべての既知のエクステンションのリストに記載されているかどうかを確認します。

source: Check if there has been a green link:https://github.com/quarkusio/extensions/actions/workflows/build_and_publish.yml[build of the extensions site] since updating the catalog
ja_jp: カタログを更新してから、緑色の link:https://github.com/quarkusio/extensions/actions/workflows/build_and_publish.yml[エクステンションサイトのビルド] があるかどうかを確認します。

source: Check if you can see active instance which should have exactly the same id
ja_jp: 全く同じ ID を持つアクティブなインスタンスが表示されているかどうかを確認します。

source: Check out "Applied AI for Enterprise Java Development" by Alex Soto Bueno, Markus Eisele, and Natale Vinto. It's a practical guide which shows you how to integrate generative AI, large language models, and machine learning into your existing Java enterprise ecosystem, using tools and frameworks you already know and love.
ja_jp: Alex Soto Bueno、Markus Eisele、Natale Vintoによる「Applied AI for Enterprise Java Development」をご覧ください。これは、生成AI、大規模言語モデル、機械学習を、すでに知っていて気に入っているツールやフレームワークを使用して、既存のJavaエンタープライズエコシステムに統合する方法を示す実践的なガイドです。

source: Check out https://quarkus.io/newsletter/10/[Newsletter #10]!
ja_jp: link:https://quarkus.io/newsletter/10/[ニュースレター #10]をご覧ください。

source: Check out https://quarkus.io/newsletter/11/[Newsletter #11]!
ja_jp: link:https://quarkus.io/newsletter/11/[ニュースレター #11]をご覧ください!

source: Check out https://quarkus.io/newsletter/12/[Newsletter #12]!
ja_jp: link:https://quarkus.io/newsletter/12/[Newsletter #12]をご覧ください。

source: Check out https://quarkus.io/newsletter/13/[Newsletter #13]!
ja_jp: link:https://quarkus.io/newsletter/13/[Newsletter #13]をご覧ください。

source: Check out https://quarkus.io/newsletter/14/[Newsletter #14]!
ja_jp: link:https://quarkus.io/newsletter/14/[Newsletter #14]をご覧ください。

source: Check out https://quarkus.io/newsletter/15/[Newsletter #15]!
ja_jp: link:https://quarkus.io/newsletter/15/[ニューズレター15号]をご覧ください。

source: Check out https://quarkus.io/newsletter/16/[Newsletter #16]!
ja_jp: link:https://quarkus.io/newsletter/16/[ニュースレター第16号]をご覧ください。

source: Check out https://quarkus.io/newsletter/17/[Newsletter #17]!
ja_jp: link:https://quarkus.io/newsletter/17/[ニュースレター #17]をご覧ください。

source: Check out https://quarkus.io/newsletter/18/[Newsletter #18]!
ja_jp: link:https://quarkus.io/newsletter/18/[Newsletter #18] をご覧ください。

source: Check out https://quarkus.io/newsletter/19/[Newsletter #19]!
ja_jp: link:https://quarkus.io/newsletter/19/[Newsletter #19] をご覧ください!

source: Check out https://quarkus.io/newsletter/20/[Newsletter #20]!
ja_jp: link:https://quarkus.io/newsletter/20/[Newsletter #20] をご覧ください。

source: Check out https://quarkus.io/newsletter/64/[Newsletter #64: January]!
ja_jp: https://quarkus.io/newsletter/64/[ニュースレター #64: 1月] をチェックしてください！

source: Check out https://quarkus.io/newsletter/65/[Newsletter #65: February]!
ja_jp: https://quarkus.io/newsletter/65/[ニュースレター #65: 2月]をチェックしてください！

source: Check out https://quarkus.io/newsletter/66/[Newsletter #66: March]!
ja_jp: https://quarkus.io/newsletter/66/[ニュースレター #66: 3月] をチェックしてください！

source: Check out https://www.youtube.com/watch?v=JNmHN5mK180[Quarkus Insights Episode #178]. You can also give it a try using https://github.com/quarkusio/quarkus-web-lab[the web-lab repo].
ja_jp: https://www.youtube.com/watch?v=JNmHN5mK180[Quarkus Insights エピソード #178] をご覧ください。また、 https://github.com/quarkusio/quarkus-web-lab[web-lab リポジトリ] を使って試すこともできます。

source: Check out https://www.youtube.com/watch?v=JNmHNSmK180[Quarkus Insights Episode #178]. First part is a hands-on demonstration of creating a CMS with Renarde. You can also give it a try using https://github.com/quarkusio/quarkus-web-lab[the web-lab repo]).
ja_jp: link:https://www.youtube.com/watch?v=JNmHNSmK180[Quarkus Insights Episode #178] をご覧ください。最初のパートは、Renardeを使ってCMSを作成するハンズオンデモです。 link:https://github.com/quarkusio/quarkus-web-lab[Web-labのレポ] を使って試してみることもできます）。

source: Check out our 5 minute https://infinispan.org/get-started/[Getting stated with Infinispan] tutorial to run Infinispan Server locally.
ja_jp: Infinispan Serverをローカルで実行するには、5分でわかる link:https://infinispan.org/get-started/[Infinispan入門] チュートリアルを参照してください。

source: Check out our 5-minute https://infinispan.org/get-started/[Getting stated with Infinispan] tutorial to run Infinispan Server locally.
ja_jp: Infinispan Serverをローカルで実行するための5分間のチュートリアル link:https://infinispan.org/get-started/[Getting stated with Infinispan]をご覧ください。

source: Check out our <a href="https://github.com/quarkusio/quarkus" target="_blank">GitHub</a> for details on reporting issues and the process for submitting pull requests.
ja_jp: 問題の報告とPull Requestの送信プロセスの詳細については、<a href="https://github.com/quarkusio/quarkus" target="_blank">GitHub</a>をご覧下さい。

source: Check out our <a href="https://github.com/quarkusio/quarkus/discussions" target="blank">GitHub Discussions</a> collaboration area to interact with other Quarkus users and developers.
ja_jp: 他の Quarkus ユーザーや開発者と交流するには、<a href="https://github.com/quarkusio/quarkus/discussions" target="blank">GitHub Discussions</a> コラボレーションエリアをご覧ください。

source: Check out the <a href="https://www.youtube.com/playlist?list=PLLEUmLgWP9osVhex2HeEovY3a2bJUPbSV">Dev UI playlist</a> on Quarkus YouTube channel to learn more.
ja_jp: Quarkus YouTubeチャンネルの<a href="https://www.youtube.com/playlist?list=PLLEUmLgWP9osVhex2HeEovY3a2bJUPbSV">Dev UIプレイリスト</a>をチェックして、詳細を確認してください。

source: Check out the existing legacy project
ja_jp: 既存のレガシープロジェクトを確認する

source: Check out the https://github.com/cescoffier/quarkus-kafka-and-avro[code] of the application, and make sure you have GraalVM installed. Then, build the native executable using:
ja_jp: アプリケーションの https://github.com/cescoffier/quarkus-kafka-and-avro[コード] を取得し、GraalVMがインストールされていることを確認してください。そして、ネイティブ実行可能ファイルを次のようにビルドします:

source: Check out the link:https://github.com/search?q=topic%3Aquarkus-extension+org%3Aquarkiverse&type=Repositories[extensions that are already there].
ja_jp: https://github.com/search?q=topic%3Aquarkus-extension+org%3Aquarkiverse&amp;type=Repositories[すでにあるエクステンション]をチェックしてみましょう。

source: Check out these applicable guides:
ja_jp: これらの関連ガイドを参照してください。

source: Check out this great "Why Quarkus Finally “Clicks”: The 10 Questions Java Developers Ask Most" by Markus Eisele as it's a great field guide based on real conversations at conferences, meetups, and across The Main Thread community. Read "Quarkus Hibernate with Panache Next" by Stéphane Épardaud to learn about the new Hibernate with Panache extension to unify both Hibernate ORM with Panache and Hibernate Reactive with Panache. Want a complete hands-on tutorial for modern, data-oriented application design? Markus Eisele has you covered with "Build Event-Sourced Systems in Quarkus with Java Records and CQRS". Check out Stéphane Philippart's blog post to learn how and why to migrate your Jekyll blog to Quarkus Roq. Read "Modern Java Meets Native Power: Image Processing with the FFM API in Quarkus" by Markus Eisele to see how Java 25 integrates with ImageMagick to unlock fast, safe, zero-JNI native workflows. Want a simple way to disable all endpoints in a Quarkus application based on a configuration property? Check out Damir Arh's post "Disable Quarkus endpoints with a request filter" for some great instruction.
ja_jp: Markus Eisele による素晴らしい記事「Why Quarkus Finally “Clicks”: The 10 Questions Java Developers Ask Most」をご覧ください。これは、カンファレンスやミートアップ、The Main Thread コミュニティでの実際の会話に基づいた優れたフィールドガイドです。Stéphane Épardaud による「Quarkus Hibernate with Panache Next」を読んで、Hibernate ORM with Panache と Hibernate Reactive with Panache の両方を統合する新しい Hibernate with Panache エクステンションについて学びましょう。モダンでデータ指向のアプリケーション設計に関する完全なハンズオンチュートリアルが必要ですか？Markus Eisele が「Build Event-Sourced Systems in Quarkus with Java Records and CQRS」でその方法を解説しています。Stéphane Philippart のブログ投稿をチェックして、Jekyll ブログを Quarkus Roq に移行する方法と理由を学びましょう。Markus Eisele による「Modern Java Meets Native Power: Image Processing with the FFM API in Quarkus」を読んで、Java 25 が ImageMagick とどのように統合され、高速で安全な、JNI を使用しないネイティブワークフローを実現するかを見てみましょう。設定プロパティーに基づいて Quarkus アプリケーション内のすべてのエンドポイントを無効にする簡単な方法が必要ですか？Damir Arh の投稿「Disable Quarkus endpoints with a request filter」をチェックして、素晴らしい指示を得ましょう。

source: Check that the external coordinator started in <<_lra-coordinators,the section on coordinators>> is still running on port 50000 and then start the service as a native executable in the background. Note that if the coordinator is not running on the default port you would need to either pass in the location of a running coordinator as a Java system property (`-Dquarkus.lra.coordinator-url=http://localhost:50000/lra-coordinator`) or you can update the application config and rebuild the native executable.
ja_jp: <<_lra-coordinators,コーディネーターのセクション>> で起動した外部コーディネーターがポート50000で動作していることを確認し、バックグラウンドでネイティブ実行可能ファイルとしてサービスを開始します。コーディネーターがデフォルト・ポートで実行されていない場合は、実行中のコーディネーターの場所をJavaシステム・プロパティ( `-Dquarkus.lra.coordinator-url=http://localhost:50000/lra-coordinator`)として渡すか、アプリケーション・コンフィグを更新してネイティブ実行可能ファイルを再ビルドする必要があることに注意してください。

source: Check the 'client_name' property in the request metadata JSON.
ja_jp: リクエストメタデータ JSON の 'client_name' プロパティーを確認します。

source: Check the 'client_name' property in the response metadata JSON.
ja_jp: レスポンスメタデータ JSON の 'client_name' プロパティーを確認します。

source: Check the <<native-reports,native build time reports>> and see if there are big discrepancies in the number of used packages, used classes or used methods. A bigger universe will result in bigger memory footprint.
ja_jp: <<native-reports,native build time reports>> を確認し、使用パッケージ数、使用クラス数、使用メソッド数に大きな相違がないかを確認します。 範囲が広いと、メモリーフットプリントが大きくなります。

source: Check the HTTP response status code and content
ja_jp: HTTP レスポンスのステータスコードと内容を確認します。

source: Check the `OAuth 2.0` check box:
ja_jp: `OAuth 2.0` チェックボックスをオンにします。

source: Check the extension is included the link:https://github.com/quarkusio/quarkus-extension-catalog/tree/main/extensions[extensions catalog list] (it only needs to be included once, and future versions will be automatically detected)
ja_jp: エクステンションが link:https://github.com/quarkusio/quarkus-extension-catalog/tree/main/extensions[エクステンションカタログリスト] に含まれていることを確認します (一度だけ含める必要があり、今後のバージョンは自動的に検出されます)

source: Check the full list of events on https://smallrye.io/smallrye-mutiny/getting-started/observing-events[the event documentation].
ja_jp: イベントの全リストは、 link:https://smallrye.io/smallrye-mutiny/getting-started/observing-events[イベントドキュメント]で確認してください。

source: Check the full list of events on https://smallrye.io/smallrye-mutiny/latest/tutorials/observing-events/[the event documentation].
ja_jp: イベントの全リストは、 https://smallrye.io/smallrye-mutiny/latest/tutorials/observing-events/[イベントのドキュメント]で確認してください。
